10/data/attachments/3939a0516cd10abb.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Jamie_let_Friend_84745_2</nif:username>
            <nif:friendToBeRequested>soap_friends_3366b451-5789-4053-9ce3-aaa5786d2676</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>